Revit 2027 API
SweptProfile.EndSetBack Property
 The distance from the end of the driving curve to the point where the sweep actually ends.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndSetBack { get; }
Public ReadOnly Property EndSetBack As Double
	Get
public:
property double EndSetBack {
	double get ();
}
member EndSetBack : float with get
Property Value
Double
See Also
Reference
SweptProfile Class
Autodesk.Revit.DB Namespace